"""
Группа КИ21-17/2Б
ФИО Студента: Новиков Владимир Владимирович
Предмет: ВвПД
Лабораторная работа №5
Вариант №5
"""
import random
import integral_view
import rect_sum


def menu():
    print('\n'
          '[1] - Осуществить расчёт матрицы интегрального представления '
          'изображения\n'
          '[2] - Найти сумму пикселей произвольного прямоугольника, '
          'ограниченного заданными пикселями\n'
          '[0] - Выйти\n')


def main():
    option = '1'
    while option != '0':
        menu()
        option = input('Выберите команду: ')
        if option == '1':
            M = 3
            N = 5
            image = [[random.randrange(0, 256)
                      for y in range(M)] for x in range(N)]
            print()
            for i in range(N):
                print(image[i])
            print('Исходное изображение\n')
            for k in range(N):
                print(integral_view.integral_view_final(image)[k])
            print('Интегральное представление изображения')
        elif option == '2':
            example = [[32, 39, 2, 20, 8, 13, 2, 5, 3],
                       [15, 14, 11, 12, 13, 14, 5, 20, 8],
                       [7, 14, 1, 0, 14, 6, 5, 13, 8],
                       [5, 13, 10, 13, 8, 1, 12, 20, 1],
                       [0, 2, 12, 20, 15, 7, 9, 30, 48],
                       [23, 54, 11, 10, 76, 30, 44, 11, 22],
                       [11, 25, 77, 22, 15, 42, 23, 5, 12],
                       [45, 33, 65, 3, 17, 8, 90, 6, 48],
                       [25, 1, 54, 54, 88, 6, 13, 56, 23],
                       [13, 8, 9, 23, 0, 78, 4, 42, 11],
                       [28, 98, 12, 45, 18, 34, 7, 28, 75],
                       [79, 14, 6, 43, 33, 89, 14, 41, 28],
                       [21, 32, 14, 13, 6, 69, 68, 60, 26],
                       [34, 76, 98, 24, 8, 5, 17, 18, 13]
                       ]
            for k in range(len(example)):
                print(example[k])
            print('Пример матрицы из описания варианта')
            try:
                x1, y1 = map(int, input('Введите координаты верхнего левого '
                                        'угла (x1, y1): ').split())
                x2, y2 = map(int, input('Введите координаты нижнего правого '
                                        'угла (x2, y2): ').split())
            except ValueError:
                print('Введены некорректные данные')
            else:
                print('Сумма пикселей производного треугольника:',
                      rect_sum.rect_sum(example, x1, y1, x2, y2))
        elif option != '0':
            print('Введены некорректные данные\n')


if __name__ == '__main__':
    main()
